#### [`repos-partners`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers-partners/runs/run-QGZpys6CE5idSv8M" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
[command]/home/runner/work/_temp/522ebfd6-fab1-4ec9-a715-784c3a7f4c52/terraform-bin plan -no-color
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers-partners/runs/run-QGZpys6CE5idSv8M

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
data.github_team.repospartners_cdktfteamcdktf_13186D35: Reading...
github_repository.repospartners_cdktfprovidermongodbatlas_repo_B439CDB5: Refreshing state... [id=cdktf-provider-mongodbatlas]
github_repository.repospartners_cdktfproviderlaunchdarklygo_repo_C9F0819B: Refreshing state... [id=cdktf-provider-launchdarkly-go]
github_repository.repospartners_cdktfprovidermongodbatlasgo_repo_718CC063: Refreshing state... [id=cdktf-provider-mongodbatlas-go]
github_repository.repospartners_cdktfproviderlaunchdarkly_repo_AF3BB314: Refreshing state... [id=cdktf-provider-launchdarkly]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavenpassword_B811F8CB: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_PASSWORD]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavenusername_6CBB637A: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_USERNAME]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretghtokenaliasPROJENGITHUBTOKEN_D014A00B: Refreshing state... [id=cdktf-provider-launchdarkly:PROJEN_GITHUB_TOKEN]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretghtokenaliasGOGITHUBTOKEN_E643F160: Refreshing state... [id=cdktf-provider-launchdarkly:GO_GITHUB_TOKEN]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretghtoken_B076E5A5: Refreshing state... [id=cdktf-provider-launchdarkly:GH_TOKEN]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secrettwineusername_EC15FA2E: Refreshing state... [id=cdktf-provider-launchdarkly:TWINE_USERNAME]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretalertprsslackwebhookurl_99526CD8: Refreshing state... [id=cdktf-provider-launchdarkly:ALERT_PRS_SLACK_WEBHOOK_URL]
github_repository_webhook.repospartners_cdktfproviderlaunchdarkly_repositorysetup_slackwebhook_9AD3D6AF: Refreshing state... [id=425871226]
github_issue_label.repospartners_cdktfproviderlaunchdarkly_repositorysetup_automergelabel_0E78197D: Refreshing state... [id=cdktf-provider-launchdarkly:automerge]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretnugetapikey_A8CFC2DD: Refreshing state... [id=cdktf-provider-launchdarkly:NUGET_API_KEY]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretnpmtoken_55C9B1E4: Refreshing state... [id=cdktf-provider-launchdarkly:NPM_TOKEN]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secrettwinepassword_F4217409: Refreshing state... [id=cdktf-provider-launchdarkly:TWINE_PASSWORD]
github_branch_protection.repospartners_cdktfproviderlaunchdarkly_repositorysetup_mainprotection_275B3DCB: Refreshing state... [id=BPR_kwDOJ_5BQc4CYBOl]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavengpgprivatekey_43CD5933: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavenstagingprofileid_919B2A41: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_STAGING_PROFILE_ID]
data.github_team.repospartners_cdktfteamcdktf_13186D35: Read complete after 5s [id=6602018]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavengpgprivatekeypassphrase_416CB401: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_issue_label.repospartners_cdktfproviderlaunchdarklygo_repositorysetup_automergelabel_35291F2B: Refreshing state... [id=cdktf-provider-launchdarkly-go:automerge]
github_repository_webhook.repospartners_cdktfproviderlaunchdarklygo_repositorysetup_slackwebhook_E7459C6F: Refreshing state... [id=425871230]
github_repository_webhook.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_slackwebhook_18FFF8DE: Refreshing state... [id=398580580]
github_issue_label.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_automergelabel_B7FEA225: Refreshing state... [id=cdktf-provider-mongodbatlas-go:automerge]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwineusername_BB8420B9: Refreshing state... [id=cdktf-provider-mongodbatlas:TWINE_USERNAME]
github_repository_webhook.repospartners_cdktfprovidermongodbatlas_repositorysetup_slackwebhook_9D8453CA: Refreshing state... [id=398580582]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenpassword_B7E76303: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_PASSWORD]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnugetapikey_F529A53B: Refreshing state... [id=cdktf-provider-mongodbatlas:NUGET_API_KEY]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnpmtoken_065C759D: Refreshing state... [id=cdktf-provider-mongodbatlas:NPM_TOKEN]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasGOGITHUBTOKEN_7F93E828: Refreshing state... [id=cdktf-provider-mongodbatlas:GO_GITHUB_TOKEN]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekeypassphrase_1A7C8C8A: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_issue_label.repospartners_cdktfprovidermongodbatlas_repositorysetup_automergelabel_3E161F2F: Refreshing state... [id=cdktf-provider-mongodbatlas:automerge]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenstagingprofileid_ACEFEFB8: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenusername_FEB58691: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_USERNAME]
github_branch_protection.repospartners_cdktfprovidermongodbatlas_repositorysetup_mainprotection_D2492D82: Refreshing state... [id=BPR_kwDOI2liXc4CAYbG]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtoken_E25B0748: Refreshing state... [id=cdktf-provider-mongodbatlas:GH_TOKEN]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretalertprsslackwebhookurl_27DBACFE: Refreshing state... [id=cdktf-provider-mongodbatlas:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwinepassword_0017705E: Refreshing state... [id=cdktf-provider-mongodbatlas:TWINE_PASSWORD]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekey_95F35FFB: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasPROJENGITHUBTOKEN_C1B036A4: Refreshing state... [id=cdktf-provider-mongodbatlas:PROJEN_GITHUB_TOKEN]
github_team_repository.repospartners_cdktfproviderlaunchdarkly_repositorysetup_managingteam_B55490C8: Refreshing state... [id=6602018:cdktf-provider-launchdarkly]
github_team_repository.repospartners_cdktfproviderlaunchdarklygo_repositorysetup_managingteam_7D3BC365: Refreshing state... [id=6602018:cdktf-provider-launchdarkly-go]
github_team_repository.repospartners_cdktfprovidermongodbatlas_repositorysetup_managingteam_0804D53A: Refreshing state... [id=6602018:cdktf-provider-mongodbatlas]
github_team_repository.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_managingteam_24105904: Refreshing state... [id=6602018:cdktf-provider-mongodbatlas-go]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_branch_protection.repospartners_cdktfproviderlaunchdarkly_repositorysetup_mainprotection_275B3DCB will be updated in-place
  ~ resource "github_branch_protection" "repospartners_cdktfproviderlaunchdarkly_repositorysetup_mainprotection_275B3DCB" {
        id                              = "BPR_kwDOJ_5BQc4CYBOl"
      ~ require_conversation_resolution = false -> true
        # (9 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repospartners_cdktfprovidermongodbatlas_repositorysetup_mainprotection_D2492D82 will be updated in-place
  ~ resource "github_branch_protection" "repospartners_cdktfprovidermongodbatlas_repositorysetup_mainprotection_D2492D82" {
        id                              = "BPR_kwDOI2liXc4CAYbG"
      ~ require_conversation_resolution = false -> true
        # (9 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_issue_label.repospartners_cdktfproviderlaunchdarkly_repositorysetup_autoapprovelabel_C68289CE will be created
  + resource "github_issue_label" "repospartners_cdktfproviderlaunchdarkly_repositorysetup_autoapprovelabel_C68289CE" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-launchdarkly"
      + url        = (known after apply)
    }

  # github_issue_label.repospartners_cdktfproviderlaunchdarklygo_repositorysetup_autoapprovelabel_87CE8614 will be created
  + resource "github_issue_label" "repospartners_cdktfproviderlaunchdarklygo_repositorysetup_autoapprovelabel_87CE8614" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-launchdarkly-go"
      + url        = (known after apply)
    }

  # github_issue_label.repospartners_cdktfprovidermongodbatlas_repositorysetup_autoapprovelabel_446E39C4 will be created
  + resource "github_issue_label" "repospartners_cdktfprovidermongodbatlas_repositorysetup_autoapprovelabel_446E39C4" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-mongodbatlas"
      + url        = (known after apply)
    }

  # github_issue_label.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_autoapprovelabel_40F05223 will be created
  + resource "github_issue_label" "repospartners_cdktfprovidermongodbatlasgo_repositorysetup_autoapprovelabel_40F05223" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-mongodbatlas-go"
      + url        = (known after apply)
    }

  # github_repository.repospartners_cdktfproviderlaunchdarkly_repo_AF3BB314 will be updated in-place
  ~ resource "github_repository" "repospartners_cdktfproviderlaunchdarkly_repo_AF3BB314" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-launchdarkly"
        name                        = "cdktf-provider-launchdarkly"
        # (32 unchanged attributes hidden)
    }

  # github_repository.repospartners_cdktfproviderlaunchdarklygo_repo_C9F0819B will be updated in-place
  ~ resource "github_repository" "repospartners_cdktfproviderlaunchdarklygo_repo_C9F0819B" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-launchdarkly-go"
        name                        = "cdktf-provider-launchdarkly-go"
        # (32 unchanged attributes hidden)
    }

  # github_repository.repospartners_cdktfprovidermongodbatlas_repo_B439CDB5 will be updated in-place
  ~ resource "github_repository" "repospartners_cdktfprovidermongodbatlas_repo_B439CDB5" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-mongodbatlas"
        name                        = "cdktf-provider-mongodbatlas"
        # (32 unchanged attributes hidden)
    }

  # github_repository.repospartners_cdktfprovidermongodbatlasgo_repo_718CC063 will be updated in-place
  ~ resource "github_repository" "repospartners_cdktfprovidermongodbatlasgo_repo_718CC063" {
      ~ allow_auto_merge            = false -> true
        id                          = "cdktf-provider-mongodbatlas-go"
        name                        = "cdktf-provider-mongodbatlas-go"
        # (32 unchanged attributes hidden)
    }

Plan: 4 to add, 6 to change, 0 to destroy.

::debug::Terraform exited with code 0.
::debug::stdout: Running plan in the remote backend. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/cdktf-team/prebuilt-providers-partners/runs/run-QGZpys6CE5idSv8M%0A%0AWaiting for the plan to start...%0A%0ATerraform v1.3.7%0Aon linux_amd64%0AInitializing plugins and modules...%0Adata.github_team.repospartners_cdktfteamcdktf_13186D35: Reading...%0Agithub_repository.repospartners_cdktfprovidermongodbatlas_repo_B439CDB5: Refreshing state... [id=cdktf-provider-mongodbatlas]%0Agithub_repository.repospartners_cdktfproviderlaunchdarklygo_repo_C9F0819B: Refreshing state... [id=cdktf-provider-launchdarkly-go]%0Agithub_repository.repospartners_cdktfprovidermongodbatlasgo_repo_718CC063: Refreshing state... [id=cdktf-provider-mongodbatlas-go]%0Agithub_repository.repospartners_cdktfproviderlaunchdarkly_repo_AF3BB314: Refreshing state... [id=cdktf-provider-launchdarkly]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavenpassword_B811F8CB: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_PASSWORD]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavenusername_6CBB637A: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_USERNAME]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretghtokenaliasPROJENGITHUBTOKEN_D014A00B: Refreshing state... [id=cdktf-provider-launchdarkly:PROJEN_GITHUB_TOKEN]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretghtokenaliasGOGITHUBTOKEN_E643F160: Refreshing state... [id=cdktf-provider-launchdarkly:GO_GITHUB_TOKEN]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretghtoken_B076E5A5: Refreshing state... [id=cdktf-provider-launchdarkly:GH_TOKEN]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secrettwineusername_EC15FA2E: Refreshing state... [id=cdktf-provider-launchdarkly:TWINE_USERNAME]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretalertprsslackwebhookurl_99526CD8: Refreshing state... [id=cdktf-provider-launchdarkly:ALERT_PRS_SLACK_WEBHOOK_URL]%0Agithub_repository_webhook.repospartners_cdktfproviderlaunchdarkly_repositorysetup_slackwebhook_9AD3D6AF: Refreshing state... [id=425871226]%0Agithub_issue_label.repospartners_cdktfproviderlaunchdarkly_repositorysetup_automergelabel_0E78197D: Refreshing state... [id=cdktf-provider-launchdarkly:automerge]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretnugetapikey_A8CFC2DD: Refreshing state... [id=cdktf-provider-launchdarkly:NUGET_API_KEY]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretnpmtoken_55C9B1E4: Refreshing state... [id=cdktf-provider-launchdarkly:NPM_TOKEN]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secrettwinepassword_F4217409: Refreshing state... [id=cdktf-provider-launchdarkly:TWINE_PASSWORD]%0Agithub_branch_protection.repospartners_cdktfproviderlaunchdarkly_repositorysetup_mainprotection_275B3DCB: Refreshing state... [id=BPR_kwDOJ_5BQc4CYBOl]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavengpgprivatekey_43CD5933: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_GPG_PRIVATE_KEY]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavenstagingprofileid_919B2A41: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_STAGING_PROFILE_ID]%0Adata.github_team.repospartners_cdktfteamcdktf_13186D35: Read complete after 5s [id=6602018]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavengpgprivatekeypassphrase_416CB401: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]%0Agithub_issue_label.repospartners_cdktfproviderlaunchdarklygo_repositorysetup_automergelabel_35291F2B: Refreshing state... [id=cdktf-provider-launchdarkly-go:automerge]%0Agithub_repository_webhook.repospartners_cdktfproviderlaunchdarklygo_repositorysetup_slackwebhook_E7459C6F: Refreshing state... [id=425871230]%0Agithub_repository_webhook.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_slackwebhook_18FFF8DE: Refreshing state... [id=398580580]%0Agithub_issue_label.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_automergelabel_B7FEA225: Refreshing state... [id=cdktf-provider-mongodbatlas-go:automerge]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwineusername_BB8420B9: Refreshing state... [id=cdktf-provider-mongodbatlas:TWINE_USERNAME]%0Agithub_repository_webhook.repospartners_cdktfprovidermongodbatlas_repositorysetup_slackwebhook_9D8453CA: Refreshing state... [id=398580582]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenpassword_B7E76303: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_PASSWORD]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnugetapikey_F529A53B: Refreshing state... [id=cdktf-provider-mongodbatlas:NUGET_API_KEY]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnpmtoken_065C759D: Refreshing state... [id=cdktf-provider-mongodbatlas:NPM_TOKEN]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasGOGITHUBTOKEN_7F93E828: Refreshing state... [id=cdktf-provider-mongodbatlas:GO_GITHUB_TOKEN]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekeypassphrase_1A7C8C8A: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]%0Agithub_issue_label.repospartners_cdktfprovidermongodbatlas_repositorysetup_automergelabel_3E161F2F: Refreshing state... [id=cdktf-provider-mongodbatlas:automerge]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenstagingprofileid_ACEFEFB8: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_STAGING_PROFILE_ID]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenusername_FEB58691: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_USERNAME]%0Agithub_branch_protection.repospartners_cdktfprovidermongodbatlas_repositorysetup_mainprotection_D2492D82: Refreshing state... [id=BPR_kwDOI2liXc4CAYbG]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtoken_E25B0748: Refreshing state... [id=cdktf-provider-mongodbatlas:GH_TOKEN]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretalertprsslackwebhookurl_27DBACFE: Refreshing state... [id=cdktf-provider-mongodbatlas:ALERT_PRS_SLACK_WEBHOOK_URL]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwinepassword_0017705E: Refreshing state... [id=cdktf-provider-mongodbatlas:TWINE_PASSWORD]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekey_95F35FFB: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_GPG_PRIVATE_KEY]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasPROJENGITHUBTOKEN_C1B036A4: Refreshing state... [id=cdktf-provider-mongodbatlas:PROJEN_GITHUB_TOKEN]%0Agithub_team_repository.repospartners_cdktfproviderlaunchdarkly_repositorysetup_managingteam_B55490C8: Refreshing state... [id=6602018:cdktf-provider-launchdarkly]%0Agithub_team_repository.repospartners_cdktfproviderlaunchdarklygo_repositorysetup_managingteam_7D3BC365: Refreshing state... [id=6602018:cdktf-provider-launchdarkly-go]%0Agithub_team_repository.repospartners_cdktfprovidermongodbatlas_repositorysetup_managingteam_0804D53A: Refreshing state... [id=6602018:cdktf-provider-mongodbatlas]%0Agithub_team_repository.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_managingteam_24105904: Refreshing state... [id=6602018:cdktf-provider-mongodbatlas-go]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # github_branch_protection.repospartners_cdktfproviderlaunchdarkly_repositorysetup_mainprotection_275B3DCB will be updated in-place%0A  ~ resource "github_branch_protection" "repospartners_cdktfproviderlaunchdarkly_repositorysetup_mainprotection_275B3DCB" {%0A        id                              = "BPR_kwDOJ_5BQc4CYBOl"%0A      ~ require_conversation_resolution = false -> true%0A        # (9 unchanged attributes hidden)%0A%0A      + required_pull_request_reviews {%0A          + dismiss_stale_reviews           = false%0A          + require_code_owner_reviews      = false%0A          + required_approving_review_count = 1%0A        }%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # github_branch_protection.repospartners_cdktfprovidermongodbatlas_repositorysetup_mainprotection_D2492D82 will be updated in-place%0A  ~ resource "github_branch_protection" "repospartners_cdktfprovidermongodbatlas_repositorysetup_mainprotection_D2492D82" {%0A        id                              = "BPR_kwDOI2liXc4CAYbG"%0A      ~ require_conversation_resolution = false -> true%0A        # (9 unchanged attributes hidden)%0A%0A      + required_pull_request_reviews {%0A          + dismiss_stale_reviews           = false%0A          + require_code_owner_reviews      = false%0A          + required_approving_review_count = 1%0A        }%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # github_issue_label.repospartners_cdktfproviderlaunchdarkly_repositorysetup_autoapprovelabel_C68289CE will be created%0A  + resource "github_issue_label" "repospartners_cdktfproviderlaunchdarkly_repositorysetup_autoapprovelabel_C68289CE" {%0A      + color      = "8BF8BD"%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + name       = "auto-approve"%0A      + repository = "cdktf-provider-launchdarkly"%0A      + url        = (known after apply)%0A    }%0A%0A  # github_issue_label.repospartners_cdktfproviderlaunchdarklygo_repositorysetup_autoapprovelabel_87CE8614 will be created%0A  + resource "github_issue_label" "repospartners_cdktfproviderlaunchdarklygo_repositorysetup_autoapprovelabel_87CE8614" {%0A      + color      = "8BF8BD"%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + name       = "auto-approve"%0A      + repository = "cdktf-provider-launchdarkly-go"%0A      + url        = (known after apply)%0A    }%0A%0A  # github_issue_label.repospartners_cdktfprovidermongodbatlas_repositorysetup_autoapprovelabel_446E39C4 will be created%0A  + resource "github_issue_label" "repospartners_cdktfprovidermongodbatlas_repositorysetup_autoapprovelabel_446E39C4" {%0A      + color      = "8BF8BD"%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + name       = "auto-approve"%0A      + repository = "cdktf-provider-mongodbatlas"%0A      + url        = (known after apply)%0A    }%0A%0A  # github_issue_label.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_autoapprovelabel_40F05223 will be created%0A  + resource "github_issue_label" "repospartners_cdktfprovidermongodbatlasgo_repositorysetup_autoapprovelabel_40F05223" {%0A      + color      = "8BF8BD"%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + name       = "auto-approve"%0A      + repository = "cdktf-provider-mongodbatlas-go"%0A      + url        = (known after apply)%0A    }%0A%0A  # github_repository.repospartners_cdktfproviderlaunchdarkly_repo_AF3BB314 will be updated in-place%0A  ~ resource "github_repository" "repospartners_cdktfproviderlaunchdarkly_repo_AF3BB314" {%0A      ~ allow_auto_merge            = false -> true%0A        id                          = "cdktf-provider-launchdarkly"%0A        name                        = "cdktf-provider-launchdarkly"%0A        # (32 unchanged attributes hidden)%0A    }%0A%0A  # github_repository.repospartners_cdktfproviderlaunchdarklygo_repo_C9F0819B will be updated in-place%0A  ~ resource "github_repository" "repospartners_cdktfproviderlaunchdarklygo_repo_C9F0819B" {%0A      ~ allow_auto_merge            = false -> true%0A        id                          = "cdktf-provider-launchdarkly-go"%0A        name                        = "cdktf-provider-launchdarkly-go"%0A        # (32 unchanged attributes hidden)%0A    }%0A%0A  # github_repository.repospartners_cdktfprovidermongodbatlas_repo_B439CDB5 will be updated in-place%0A  ~ resource "github_repository" "repospartners_cdktfprovidermongodbatlas_repo_B439CDB5" {%0A      ~ allow_auto_merge            = false -> true%0A        id                          = "cdktf-provider-mongodbatlas"%0A        name                        = "cdktf-provider-mongodbatlas"%0A        # (32 unchanged attributes hidden)%0A    }%0A%0A  # github_repository.repospartners_cdktfprovidermongodbatlasgo_repo_718CC063 will be updated in-place%0A  ~ resource "github_repository" "repospartners_cdktfprovidermongodbatlasgo_repo_718CC063" {%0A      ~ allow_auto_merge            = false -> true%0A        id                          = "cdktf-provider-mongodbatlas-go"%0A        name                        = "cdktf-provider-mongodbatlas-go"%0A        # (32 unchanged attributes hidden)%0A    }%0A%0APlan: 4 to add, 6 to change, 0 to destroy.%0A%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Pusher: @xiehan, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*